{
  "basics": {
    "name": "Raúl García Fernández",
    "label": "Full Stack Developer con más de 6 años de experiencia",
    "image": "/me.jpg",
    "email": "rauligf97@gmail.com",
    "phone": "+53 58884800",
    "url": "",
    "summary": "Con más de 6 años de experiencia como desarrollador Full Stack, me he especializado en la creación de soluciones tecnológicas integrales, abarcando desde el diseño de interfaces de usuario hasta la optimización de bases de datos. Mi enfoque se centra en desarrollar aplicaciones y sitios web eficientes, visualmente atractivos y funcionales, asegurando que cada proyecto cumpla con los más altos estándares de calidad y ofrezca una experiencia de usuario excepcional. Me apasiona transformar ideas complejas en soluciones prácticas y escalables, adaptadas a las necesidades específicas de cada cliente.",
    "location": {
      "address": "",
      "postalCode": "11300",
      "city": "Playa, Ciudad de la Habana",
      "countryCode": "CU",
      "region": "Cuba"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "raul-garc",
        "url": "https://www.linkedin.com/in/raul-garc%C3%ADa-630467116/"
      },
      {
        "network": "GitHub",
        "username": "Turing0x",
        "url": "https://github.com/Turing0x"
      }
    ]
  },
  "work": [
    {
      "name": "DIP Mariel",
      "position": "Full Stack Developer",
      "url": "https://www.facebook.com/dipmarielcu",
      "startDate": "2021-04-03",
      "endDate": "2021-07-22",
      "summary": "Desarrollo de una aplicación para Windows, DipProy, está enfocado en la Gestión de Documentación de los ingenieros a pie de obra. "
    },
    {
      "name": "GoSeeClient",
      "position": "Full Stack Developer",
      "url": "https://twitch.tv/midudev",
      "startDate": "2021-06-01",
      "endDate": "2022-09-01",
      "summary": "Desarrollo de la aplicación móvil GoSeeClient. Esta aplicación busca organizar, supervisar y facilitar una comunicación segura y constante con los clientes de un emprendedor específico. Se utilizó Flutter + Dart y SQLite para la gestión de datos. Mantenimiento y actualización en curso."
    },
    {
      "name": "NEXTGEN",
      "position": "Senior BackEnd Developer",
      "startDate": "2022-03-01",
      "endDate": "2023-05-01",
      "summary": "Desarrollo back-end de la aplicación web. Trabajamos con NodeJS - Express y MongoDB. Durante este proceso, se aprendió y aplicó la arquitectura de programación Hexagonal y Vertical Slice. Mantenimiento y actualización en curso."
    },
    {
      "name": "Viaja Conmigo",
      "position": "Mobile Developer & Mobile Dev Leader",
      "startDate": "2023-03-01",
      "endDate": "2023-05-01",
      "summary": "Viaja Conmigo es una aplicación móvil innovadora diseñada para agencias de viajes cubanas. Esta herramienta digital optimiza la gestión de transporte público, proveedores de transporte y servicios de carga, proporcionando una experiencia de viaje integrada y eficiente. Con Viaja Conmigo, los usuarios pueden planificar y reservar viajes de manera rápida y sencilla, desde la comodidad de su dispositivo móvil. La aplicación ofrece una plataforma completa para la gestión de reservas, incluyendo taxis, trenes y otros medios de transporte, y proporciona información en tiempo real sobre horarios, rutas y disponibilidad de servicios. Además, se centra en la experiencia del cliente, ofreciendo un servicio al cliente personalizado y opciones de pago seguras y convenientes."
    },
    {
      "name": "E' Gustazo Cubano",
      "position": "Full Stack Developer & Team Leader",
      "startDate": "2023-03-01",
      "endDate": "2023-07-01",
      "summary": "E' Gustazo Cubano es una aplicación móvil innovadora diseñada específicamente para pequeñas y medianas empresas (MIPYMES) en Cuba que comercializan productos alimenticios, electrodomésticos y más. La aplicación ofrece una plataforma digital que facilita la gestión de negocios, permitiendo a los usuarios llegar a una amplia audiencia de consumidores. Con E' Gustazo Cubano, las empresas pueden mostrar su catálogo de productos, establecer una presencia en línea sólida y atractiva, y facilitar transacciones seguras y eficientes. Además, la aplicación promueve la autenticidad y la cultura cubana, proporcionando una ventana a la gastronomía y la artesanía cubanas para un público más amplio."
    },
    {
      "name": "Software como Trabajo de Diploma",
      "position": "Full Stack Developer & Team Leader",
      "startDate": "2024-07-01",
      "endDate": "2024-12-01",
      "summary": "La investigación desarrolló un módulo semiautomatizado diseñado para generar ficheros de configuración de servicios telemáticos en sistemas Linux, con el objetivo de optimizar el proceso de aprendizaje en la asignatura Redes y Seguridad Informática 2. Este módulo aborda las limitaciones de los métodos tradicionales empleados en el aula, como la indicación manual y la distribución de scripts preelaborados, que presentan desafíos en términos de eficiencia y precisión. Al automatizar la creación de ficheros de configuración, se facilita la personalización de escenarios de prácticas, reduciendo el tiempo invertido por los docentes y mejorando la calidad de la enseñanza. Este enfoque permite que los estudiantes se concentren en los conceptos clave de la asignatura, como la gestión y configuración de servicios telemáticos, sin la necesidad de memorizar parámetros o rutas específicas. Además, el módulo contribuye a la mejora de la enseñanza de las tecnologías de la información y la comunicación (TIC), favoreciendo un aprendizaje más estructurado y eficiente."
    },
    {
      "name": "Marcerl Al Productions",
      "position": "Full Stack Developer & Team Leader",
      "startDate": "2024-07-01",
      "endDate": null,
      "summary": "Marcel AL Productions es una empresa especializada en diseño gráfico y producción audiovisual, dedicada a brindar soluciones personalizadas que potencien el alcance de las plataformas de comercio electrónico y marketplaces de nuestros clientes. Nuestros servicios incluyen desarrollo de marca, optimización SEO, gestión de ingreso de datos para soporte multilingüe y transcripciones de videos. Trabajamos en estrecha colaboración con nuestros clientes para garantizar que cada proyecto se alinee con su visión y maximice su visibilidad en el mercado global. Nuestro objetivo es ayudar a las empresas a destacarse mediante la creación de contenido atractivo y la optimización de su presencia digital para el éxito."
    },
    {
      "name": "4Life Tips",
      "position": "Full Stack Developer & Team Leader",
      "startDate": "2024-07-01",
      "url": "https://4lifetips-csg.pages.dev/",
      "endDate": null,
      "summary": "4Life Tips es un recurso que ofrece guías detalladas y recomendaciones para el uso de los productos 4Life, diseñados para mejorar la función inmunitaria y el bienestar general. La plataforma se centra en brindar información sobre los beneficios de productos como 4Life Transfer Factor, así como en promover un enfoque equilibrado de la salud a través de la nutrición, los antioxidantes, el apoyo cognitivo y más. El sitio también destaca ofertas especiales, incluidos descuentos y la importancia de consultar a profesionales de la salud antes de usar los productos en contextos médicos."
    },
    {
      "name": "IndustrialX | Ofreciendo soluciones",
      "position": "Full Stack Developer & Team Leader",
      "url": "https://industialx-frontend.pages.dev/",
      "startDate": "2024-07-01",
      "endDate": null,
      "summary": "Se está desarrollando una plataforma de comercio electrónico enfocada en la comercialización de productos alimenticios en Cuba. Este proyecto tiene como objetivo principal modernizar y agilizar el proceso de compra y venta en el sector alimenticio, brindando una experiencia de usuario intuitiva y accesible tanto para comerciantes como para consumidores. Como elemento clave de cualquier e-commerce, el proyecto incluye la gestión de catálogos de productos, carrito de compras, sistema de órdenes y notificaciones en tiempo real. Además, se integra la pasarela de pago TropiPay para facilitar transacciones seguras y confiables, adaptadas al contexto local. El proyecto, aún en desarrollo, busca cubrir una necesidad creciente en el mercado cubano, ofreciendo una solución eficiente para la comercialización y distribución de alimentos en un entorno digital."
    }
  ],
  "volunteer": [
    {
      "organization": "Organization",
      "position": "Volunteer",
      "url": "https://organization.com/",
      "startDate": "2012-01-01",
      "endDate": "2013-01-01",
      "summary": "Description…",
      "highlights": ["Awarded 'Volunteer of the Month'"]
    }
  ],
  "education": [
    {
      "institution": "Universidad de las Ciencias Informáticas",
      "url": "https://www.uci.cu/",
      "area": "Ingeniero en Ciencias Informáticas",
      "studyType": "Ingeniería",
      "startDate": "2021-11-01",
      "endDate": "2024-12-19",
      "score": "4.22",
      "courses": [
        "Matemática Avanzada",
        "Arquitectura de Computadoras",
        "Sistemas de Base de Datos (SQL & NoSQL)",
        "Reconocimiento de Patrones",
        "Redes y Seguridad Informática",
        "Comercio Electrónico"
      ]
    }
  ],
  "awards": [
    {
      "title": "Award",
      "date": "2014-11-01",
      "awarder": "Company",
      "summary": "There is no spoon."
    }
  ],
  "certificates": [
    {
      "name": "Certificate",
      "date": "2021-11-07",
      "issuer": "Company",
      "url": "https://certificate.com"
    }
  ],
  "publications": [
    {
      "name": "Publication",
      "publisher": "Company",
      "releaseDate": "2014-10-01",
      "url": "https://publication.com",
      "summary": "Description…"
    }
  ],
  "skills": [
    {
      "name": "HTML",
      "level": "Master",
      "keywords": ["Desarrollo Web", "Frontend"]
    },
    {
      "name": "CSS",
      "level": "Master",
      "keywords": ["Desarrollo Web", "Frontend", "Diseño Responsive"]
    },
    {
      "name": "JavaScript",
      "level": "Master",
      "keywords": ["Desarrollo Web", "Frontend", "Backend", "Fullstack"]
    },
    {
      "name": "Tailwind",
      "level": "Avanzado",
      "keywords": [
        "Desarrollo Web",
        "Frontend",
        "CSS Framework",
        "Diseño Responsive"
      ]
    },
    {
      "name": "TypeScript",
      "level": "Avanzado",
      "keywords": [
        "Desarrollo Web",
        "Frontend",
        "Backend",
        "JavaScript Superset"
      ]
    },
    {
      "name": "Node",
      "level": "Avanzado",
      "keywords": ["Desarrollo Web", "Backend", "JavaScript", "Servidor"]
    },
    {
      "name": "MySQL",
      "level": "Avanzado",
      "keywords": [
        "Bases de Datos",
        "SQL",
        "Almacenamiento de Datos",
        "Backend"
      ]
    },
    {
      "name": "Git",
      "level": "Avanzado",
      "keywords": ["Control de Versiones", "Colaboración", "Código Fuente"]
    },
    {
      "name": "GitHub",
      "level": "Avanzado",
      "keywords": [
        "Control de Versiones",
        "Colaboración",
        "Código Fuente",
        "Git"
      ]
    },
    {
      "name": "React",
      "level": "Avanzado",
      "keywords": ["Desarrollo Web", "Frontend", "JavaScript Library", "UI"]
    },
    {
      "name": "Flutter - Dart",
      "level": "Avanzado",
      "keywords": ["Desarrollo Móvil", "Frontend", "Flutter Framework"]
    },
    {
      "name": "Spring Boot",
      "level": "Avanzado",
      "keywords": ["Backend", "Java"]
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Advanced"
    }
  ],
  "interests": [
    {
      "name": "Wildlife",
      "keywords": ["Ferrets", "Unicorns"]
    }
  ],
  "references": [
    {
      "name": "Jane Doe",
      "reference": "Reference…"
    }
  ],
  "projects": [
    {
      "name": "mars.codes",
      "isActive": true,
      "description": "Historia interactiva con retos de programación para viajar a Marte",
      "highlights": ["Elige tu propia aventura", "En desarrollo"],
      "url": "https://mars.codes"
    },
    {
      "name": "AdventJS",
      "isActive": true,
      "description": "Retos de programación en JavaScript para cada día de diciembre hasta Navidad",
      "highlights": [
        "+1 millón de visitas",
        "Multidioma",
        "JavaScript & TypeScript"
      ],
      "url": "https://adventjs.dev"
    },
    {
      "name": "Codember",
      "isActive": true,
      "description": "Juego interactivo de programación con retos y secretos",
      "highlights": ["+2000 usuarios activos", "Retos para cualquier lenguaje"],
      "url": "https://codember.dev"
    },
    {
      "name": "codi.link",
      "isActive": true,
      "description": "Playground de código HTML, CSS y JavaScript para compartir",
      "highlights": ["100k visitas al mes", "Desarrollado por la comunidad"],
      "url": "https://codi.link",
      "github": "https://github.com/midudev/codi.link"
    },
    {
      "name": "Pruebas Técnicas",
      "isActive": true,
      "description": "Lista de pruebas técnicas de empresas para practicar programación",
      "highlights": ["100% gratuito", "+500 soluciones de la comunidad"],
      "url": "https://pruebastecnicas.com",
      "github": "https://github.com/midudev/pruebas-tecnicas"
    },
    {
      "name": "miduConf",
      "description": "Conferencia de programación en streaming para la comunidad hispanohablante con charlas top",
      "highlights": ["+15k tickets repartidos", "+50k espectadores en directo"],
      "url": "https://miduconf.com"
    }
  ]
}
